protogia/avr-descriptionfiles-4-nim/svd/AT90USB1287.atdf.svd
        <register>
          <name>SMCR</name>
          <description>Sleep Mode Control Register</description>
          <addressOffset>0x15</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SE</name>
              <description>Sleep Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SM</name>
              <description>Sleep Mode Select bits</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>ADC Noise Reduction (If Available)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDOWN</name>
                  <description>Power Down</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSAVE</name>
                  <description>Power Save</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x04</name>
                  <description>Reserved</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x05</name>
                  <description>Reserved</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STDBY</name>
                  <description>Standby</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ESTDBY</name>
                  <description>Extended Standby</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XMCRA</name>
          <description>External Memory Control Register A</description>
          <addressOffset>0x36</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRW0</name>
              <description>Wait state select bit lower page</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_WAIT_STATES</name>
                  <description>No wait-states</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_ONE_CYCLE_DURING_READ_WRITE_STROBE</name>
                  <description>Wait one cycle during read/write strobe</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_TWO_CYCLES_DURING_READ_WRITE_STROBE</name>
                  <description>Wait two cycles during read/write strobe</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_TWO_CYCLES_DURING_READ_WRITE_AND_WAIT_ONE_CYCLE_BEFORE_DRIVING_OUT_NEW_ADDRESS</name>
                  <description>Wait two cycles during read/write and wait one cycle before driving out new address</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRW1</name>
              <description>Wait state select bit upper page</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_WAIT_STATES</name>
                  <description>No wait-states</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_ONE_CYCLE_DURING_READ_WRITE_STROBE</name>
                  <description>Wait one cycle during read/write strobe</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_TWO_CYCLES_DURING_READ_WRITE_STROBE</name>
                  <description>Wait two cycles during read/write strobe</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_TWO_CYCLES_DURING_READ_WRITE_AND_WAIT_ONE_CYCLE_BEFORE_DRIVING_OUT_NEW_ADDRESS</name>
                  <description>Wait two cycles during read/write and wait one cycle before driving out new address</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRL</name>
              <description>Wait state page limit</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LS_N_A_US_0X1100_0XFFFF</name>
                  <description>LS = N/A, US = 0x1100 - 0xFFFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X2100_0X1FFF_US_0X2000_0XFFFF</name>
                  <description>LS = 0x2100 - 0x1FFF, US = 0x2000 - 0xFFFF</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X2100_0X3FFF_US_0X4000_0XFFFF</name>
                  <description>LS = 0x2100 - 0x3FFF, US = 0x4000 - 0xFFFF</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X2100_0X5FFF_US_0X6000_0XFFFF</name>
                  <description>LS = 0x2100 - 0x5FFF, US = 0x6000 - 0xFFFF</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X2100_0X7FFF_US_0X8000_0XFFFF</name>
                  <description>LS = 0x2100 - 0x7FFF, US = 0x8000 - 0xFFFF</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X2100_0X9FFF_US_0XA000_0XFFFF</name>
                  <description>LS = 0x2100 - 0x9FFF, US = 0xA000 - 0xFFFF</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X2100_0XBFFF_US_0XC000_0XFFFF</name>
                  <description>LS = 0x2100 - 0xBFFF, US = 0xC000 - 0xFFFF</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X2100_0XDFFF_US_0XE000_0XFFFF</name>
                  <description>LS = 0x2100 - 0xDFFF, US = 0xE000 - 0xFFFF</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRE</name>
              <description>External SRAM Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XMCRB</name>
          <description>External Memory Control Register B</description>
          <addressOffset>0x37</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XMM</name>
              <description>External Memory High Mask</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PX7</name>
                  <description>Px7</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PX7_PX6</name>
                  <description>Px7-Px6</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PX7_PX5</name>
                  <description>Px7-Px5</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PX7_PX4</name>
                  <description>Px7-Px4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PX7_PX3</name>
                  <description>Px7-Px3</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PX7_PX2</name>
                  <description>Px7-Px2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL_PORT_X</name>
                  <description>Full Port X</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XMBK</name>
              <description>External Memory Bus Keeper Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
